04_OpenFoam/_ref/OpenFOAM-14/multiRegion/film/VoFToFilm/0/VoF/alpha.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/VoF";
    object      alpha.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField
{
    type        zonal;

    defaultValue    0;

    zones
    {
        liquid
        {
            type            box;
            box             (0 0 -1) (1 0.08 1);
            value           1;
        }
    }
}

boundaryField
{
    film
    {
        type            zeroGradient;
    }

    bottom
    {
        type            zeroGradient;
    }

    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
